cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap "homebrew/cask-fonts"
# tap 'universal-ctags/universal-ctags'             # Migrated to dev-misc module
# tap 'neovim/neovim'                               # Migrated to vim module
# tap 'getantibody/tap'                             # Migrated to zsh module

#Fonts
# cask 'font-ubuntu'
# cask 'font-ubuntumono-nerd-font'

#Formulas
# brew 'git'                                        # Migrated to git module
# brew 'diff-so-fancy'                              # Migrated to git module
# brew 'vim', args: ["with-override-system-vi"]     # Migrated to vim module
# brew 'neovim'                                     # Migrated to vim module
# brew 'tmux'                                       # Migrated to tmux module
# brew 'clang-format'                               # Migrated to dev-misc module
# brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"] # Migrated to dev-misc module
# brew 'zsh'                                        # Migrated to zsh module
# brew 'zsh-completions'                            # Migrated to zsh module
# brew 'zsh-autosuggestions'                        # Migrated to zsh module
# brew 'getantibody/tap/antibody'                   # Migrated to zsh module
# brew 'llvm', args: ["with-toolchain"]
brew 'mas'
brew 'bash'
brew 'bash-completion'
brew 'make'
brew 'cmake'
brew "ninja"
brew "gcc"
brew "gdb"
brew 'python'
brew 'python3'
brew 'ruby'
brew 'node'
brew 'ffmpeg'
brew 'imagemagick'
brew 'the_silver_searcher'
brew 'ag'
brew 'fzy'
brew 'fzf'
brew 'youtube-dl'
brew 'thefuck'
brew 'tree'
brew 'ranger'
brew 'terminal-notifier'
brew 'tmuxinator-completion'
brew "htop"
brew "pandoc"
brew "MisterTea/et/et"

#GNU tools
brew 'coreutils'
brew 'gnu-sed', args: ["with-default-names"]
brew 'gnu-which', args: ["with-default-names"]

#Casks
# cask 'iTerm2'                                     # Migrated to iterm module
# cask 'visual-studio-code'                         # Migrated to vscode module
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'clipy'
cask 'firefox'
cask 'github'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask "spotify-notifications"
cask 'the-unarchiver'
cask 'iina'                                         # Video Player
cask 'contexts'                                     # Task Switcher
cask 'WhatsApp'

#Mac AppStore
mas "Xcode", id: 497799835
mas "GIPHY CAPTURE", id: 668208984
mas "Amphetamine", id: 937984704                    # Screen Awakener
mas 'Spark', id: 1176895641                         # Mail Client
