cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/bundle'
tap "homebrew/cask-fonts"
tap 'caskroom/cask'
tap 'caskroom/fonts'
#tap 'neovim/neovim'
tap 'universal-ctags/universal-ctags'
#tap 'getantibody/tap'

#Fonts
cask 'font-ubuntu'
cask 'font-ubuntumono-nerd-font'

#Formulas
brew 'bash'
brew 'make'
brew 'vim', args: ["with-override-system-vi"]
brew 'git'
brew 'python'
brew 'python3'
brew 'ag'
brew 'bash-completion'
brew 'clang-format'
brew 'cmake'
#brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'imagemagick'
#brew 'neovim'
brew 'the_silver_searcher'
brew 'ruby'
brew 'tmux'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ["HEAD"]
brew 'youtube-dl'
#brew 'zsh'
#brew 'zsh-completions'
#brew 'zsh-autosuggestions'
#brew 'getantibody/tap/antibody'
brew 'node'
brew 'thefuck'
brew 'tree'
brew 'mas'
brew 'fzy'
brew 'fzf'
brew 'ranger'
brew 'terminal-notifier'
brew 'tmuxinator-completion'
# brew 'llvm', args: ["with-toolchain"]
brew "gcc"
brew "gdb"
brew "htop"
brew "ninja"
brew "pandoc"

#GNU tools
brew 'coreutils'
brew 'gnu-sed', args: ["with-default-names"]
brew 'gnu-which', args: ["with-default-names"]

#Casks
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'clipy'
cask 'firefox'
cask 'github'
#cask 'iTerm2'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'                # Window Manager
cask 'spotify'
cask "spotify-notifications"
#cask 'visual-studio-code'
cask 'the-unarchiver'
cask 'iina'                     # Video Player
cask 'contexts'                 # Task Switcher

#Mac AppStore
mas "Xcode", id: 497799835
mas "GIPHY CAPTURE", id: 668208984
mas "Amphetamine", id: 937984704    # Screen Awakener
mas 'Spark', id: 1176895641         # Mail Client
